projects/12_boat_hull_floating/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-0.5  -0.25  -0.20)   // 0
    ( 1.0  -0.25  -0.20)   // 1
    ( 1.0   0.25  -0.20)   // 2
    (-0.5   0.25  -0.20)   // 3
    (-0.5  -0.25   0.15)   // 4
    ( 1.0  -0.25   0.15)   // 5
    ( 1.0   0.25   0.15)   // 6
    (-0.5   0.25   0.15)   // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (60 20 14) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }

    atmosphere
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }

    bottom
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }

    sides
    {
        type patch;
        faces
        (
            (0 1 5 4)
            (3 7 6 2)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
